Klipper3d/klipper/lib/asf/sam/utils/cmsis/sam4l/include/component/component_acifc.h
/**
 * \file
 *
 * \brief Component description for ACIFC
 *
 * Copyright (c) 2014-2018 Microchip Technology Inc. and its subsidiaries.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Subject to your compliance with these terms, you may use Microchip
 * software and any derivatives exclusively with Microchip products.
 * It is your responsibility to comply with third party license terms applicable
 * to your use of third party software (including open source software) that
 * may accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES,
 * WHETHER EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE,
 * INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY,
 * AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT WILL MICROCHIP BE
 * LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE
 * SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS BEEN ADVISED OF THE
 * POSSIBILITY OR THE DAMAGES ARE FORESEEABLE.  TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY
 * RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF ANY,
 * THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 * \asf_license_stop
 *
 */
/*
 * Support and FAQ: visit <a href="https://www.microchip.com/support/">Microchip Support</a>
 */

#ifndef _SAM4L_ACIFC_COMPONENT_
#define _SAM4L_ACIFC_COMPONENT_

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR ACIFC */
/* ========================================================================== */
/** \addtogroup SAM4L_ACIFC Analog Comparator Interface */
/*@{*/

#define REV_ACIFC                   0x101

/* -------- ACIFC_CTRL : (ACIFC Offset: 0x00) (R/W 32) Control Register -------- */
#define ACIFC_CTRL_OFFSET           0x00         /**< \brief (ACIFC_CTRL offset) Control Register */
#define ACIFC_CTRL_RESETVALUE       0x00000000   /**< \brief (ACIFC_CTRL reset_value) Control Register */

#define ACIFC_CTRL_EN_Pos           0            /**< \brief (ACIFC_CTRL) ACIFC Enable */
#define ACIFC_CTRL_EN               (0x1u << ACIFC_CTRL_EN_Pos)
#define ACIFC_CTRL_EVENTEN_Pos      1            /**< \brief (ACIFC_CTRL) Peripheral Event Trigger Enable */
#define ACIFC_CTRL_EVENTEN          (0x1u << ACIFC_CTRL_EVENTEN_Pos)
#define ACIFC_CTRL_USTART_Pos       4            /**< \brief (ACIFC_CTRL) User Start Single Comparison */
#define ACIFC_CTRL_USTART           (0x1u << ACIFC_CTRL_USTART_Pos)
#define ACIFC_CTRL_ESTART_Pos       5            /**< \brief (ACIFC_CTRL) Peripheral Event Start Single Comparison */
#define ACIFC_CTRL_ESTART           (0x1u << ACIFC_CTRL_ESTART_Pos)
#define ACIFC_CTRL_ACTEST_Pos       7            /**< \brief (ACIFC_CTRL) Analog Comparator Test Mode */
#define ACIFC_CTRL_ACTEST           (0x1u << ACIFC_CTRL_ACTEST_Pos)
#define ACIFC_CTRL_MASK             0x000000B3u  /**< \brief (ACIFC_CTRL) MASK Register */

/* -------- ACIFC_SR : (ACIFC Offset: 0x04) (R/  32) Status Register -------- */
#define ACIFC_SR_OFFSET             0x04         /**< \brief (ACIFC_SR offset) Status Register */
#define ACIFC_SR_RESETVALUE         0x00000000   /**< \brief (ACIFC_SR reset_value) Status Register */

#define ACIFC_SR_ACCS0_Pos          0            /**< \brief (ACIFC_SR) AC0 Current Comparison Status */
#define ACIFC_SR_ACCS0              (0x1u << ACIFC_SR_ACCS0_Pos)
#define ACIFC_SR_ACRDY0_Pos         1            /**< \brief (ACIFC_SR) AC0 Ready */
#define ACIFC_SR_ACRDY0             (0x1u << ACIFC_SR_ACRDY0_Pos)
#define ACIFC_SR_ACCS1_Pos          2            /**< \brief (ACIFC_SR) AC1 Current Comparison Status */
#define ACIFC_SR_ACCS1              (0x1u << ACIFC_SR_ACCS1_Pos)
#define ACIFC_SR_ACRDY1_Pos         3            /**< \brief (ACIFC_SR) AC1 Ready */
#define ACIFC_SR_ACRDY1             (0x1u << ACIFC_SR_ACRDY1_Pos)
#define ACIFC_SR_ACCS2_Pos          4            /**< \brief (ACIFC_SR) AC2 Current Comparison Status */
#define ACIFC_SR_ACCS2              (0x1u << ACIFC_SR_ACCS2_Pos)
#define ACIFC_SR_ACRDY2_Pos         5            /**< \brief (ACIFC_SR) AC2 Ready */
#define ACIFC_SR_ACRDY2             (0x1u << ACIFC_SR_ACRDY2_Pos)
#define ACIFC_SR_ACCS3_Pos          6            /**< \brief (ACIFC_SR) AC3 Current Comparison Status */
#define ACIFC_SR_ACCS3              (0x1u << ACIFC_SR_ACCS3_Pos)
#define ACIFC_SR_ACRDY3_Pos         7            /**< \brief (ACIFC_SR) AC3 Ready */
#define ACIFC_SR_ACRDY3             (0x1u << ACIFC_SR_ACRDY3_Pos)
#define ACIFC_SR_ACCS4_Pos          8            /**< \brief (ACIFC_SR) AC4 Current Comparison Status */
#define ACIFC_SR_ACCS4              (0x1u << ACIFC_SR_ACCS4_Pos)
#define ACIFC_SR_ACRDY4_Pos         9            /**< \brief (ACIFC_SR) AC4 Ready */
#define ACIFC_SR_ACRDY4             (0x1u << ACIFC_SR_ACRDY4_Pos)
#define ACIFC_SR_ACCS5_Pos          10           /**< \brief (ACIFC_SR) AC5 Current Comparison Status */
#define ACIFC_SR_ACCS5              (0x1u << ACIFC_SR_ACCS5_Pos)
#define ACIFC_SR_ACRDY5_Pos         11           /**< \brief (ACIFC_SR) AC5 Ready */
#define ACIFC_SR_ACRDY5             (0x1u << ACIFC_SR_ACRDY5_Pos)
#define ACIFC_SR_ACCS6_Pos          12           /**< \brief (ACIFC_SR) AC6 Current Comparison Status */
#define ACIFC_SR_ACCS6              (0x1u << ACIFC_SR_ACCS6_Pos)
#define ACIFC_SR_ACRDY6_Pos         13           /**< \brief (ACIFC_SR) AC6 Ready */
#define ACIFC_SR_ACRDY6             (0x1u << ACIFC_SR_ACRDY6_Pos)
#define ACIFC_SR_ACCS7_Pos          14           /**< \brief (ACIFC_SR) AC7 Current Comparison Status */
#define ACIFC_SR_ACCS7              (0x1u << ACIFC_SR_ACCS7_Pos)
#define ACIFC_SR_ACRDY7_Pos         15           /**< \brief (ACIFC_SR) AC7 Ready */
#define ACIFC_SR_ACRDY7             (0x1u << ACIFC_SR_ACRDY7_Pos)
#define ACIFC_SR_WFCS0_Pos          24           /**< \brief (ACIFC_SR) Window0 Mode Current Status */
#define ACIFC_SR_WFCS0              (0x1u << ACIFC_SR_WFCS0_Pos)
#define ACIFC_SR_WFCS1_Pos          25           /**< \brief (ACIFC_SR) Window1 Mode Current Status */
#define ACIFC_SR_WFCS1              (0x1u << ACIFC_SR_WFCS1_Pos)
#define ACIFC_SR_WFCS2_Pos          26           /**< \brief (ACIFC_SR) Window2 Mode Current Status */
#define ACIFC_SR_WFCS2              (0x1u << ACIFC_SR_WFCS2_Pos)
#define ACIFC_SR_WFCS3_Pos          27           /**< \brief (ACIFC_SR) Window3 Mode Current Status */
#define ACIFC_SR_WFCS3              (0x1u << ACIFC_SR_WFCS3_Pos)
#define ACIFC_SR_MASK               0x0F00FFFFu  /**< \brief (ACIFC_SR) MASK Register */

