Klipper3d/klipper/lib/asf/sam/utils/cmsis/sam4l/include/component/component_acifc.h
/* -------- ACIFC_IER : (ACIFC Offset: 0x10) ( /W 32) Interrupt Enable Register -------- */
#define ACIFC_IER_OFFSET            0x10         /**< \brief (ACIFC_IER offset) Interrupt Enable Register */
#define ACIFC_IER_RESETVALUE        0x00000000   /**< \brief (ACIFC_IER reset_value) Interrupt Enable Register */

#define ACIFC_IER_ACINT0_Pos        0            /**< \brief (ACIFC_IER) AC0 Interrupt Enable */
#define ACIFC_IER_ACINT0            (0x1u << ACIFC_IER_ACINT0_Pos)
#define ACIFC_IER_SUTINT0_Pos       1            /**< \brief (ACIFC_IER) AC0 Startup Time Interrupt Enable */
#define ACIFC_IER_SUTINT0           (0x1u << ACIFC_IER_SUTINT0_Pos)
#define ACIFC_IER_ACINT1_Pos        2            /**< \brief (ACIFC_IER) AC1 Interrupt Enable */
#define ACIFC_IER_ACINT1            (0x1u << ACIFC_IER_ACINT1_Pos)
#define ACIFC_IER_SUTINT1_Pos       3            /**< \brief (ACIFC_IER) AC1 Startup Time Interrupt Enable */
#define ACIFC_IER_SUTINT1           (0x1u << ACIFC_IER_SUTINT1_Pos)
#define ACIFC_IER_ACINT2_Pos        4            /**< \brief (ACIFC_IER) AC2 Interrupt Enable */
#define ACIFC_IER_ACINT2            (0x1u << ACIFC_IER_ACINT2_Pos)
#define ACIFC_IER_SUTINT2_Pos       5            /**< \brief (ACIFC_IER) AC2 Startup Time Interrupt Enable */
#define ACIFC_IER_SUTINT2           (0x1u << ACIFC_IER_SUTINT2_Pos)
#define ACIFC_IER_ACINT3_Pos        6            /**< \brief (ACIFC_IER) AC3 Interrupt Enable */
#define ACIFC_IER_ACINT3            (0x1u << ACIFC_IER_ACINT3_Pos)
#define ACIFC_IER_SUTINT3_Pos       7            /**< \brief (ACIFC_IER) AC3 Startup Time Interrupt Enable */
#define ACIFC_IER_SUTINT3           (0x1u << ACIFC_IER_SUTINT3_Pos)
#define ACIFC_IER_ACINT4_Pos        8            /**< \brief (ACIFC_IER) AC4 Interrupt Enable */
#define ACIFC_IER_ACINT4            (0x1u << ACIFC_IER_ACINT4_Pos)
#define ACIFC_IER_SUTINT4_Pos       9            /**< \brief (ACIFC_IER) AC4 Startup Time Interrupt Enable */
#define ACIFC_IER_SUTINT4           (0x1u << ACIFC_IER_SUTINT4_Pos)
#define ACIFC_IER_ACINT5_Pos        10           /**< \brief (ACIFC_IER) AC5 Interrupt Enable */
#define ACIFC_IER_ACINT5            (0x1u << ACIFC_IER_ACINT5_Pos)
#define ACIFC_IER_SUTINT5_Pos       11           /**< \brief (ACIFC_IER) AC5 Startup Time Interrupt Enable */
#define ACIFC_IER_SUTINT5           (0x1u << ACIFC_IER_SUTINT5_Pos)
#define ACIFC_IER_ACINT6_Pos        12           /**< \brief (ACIFC_IER) AC6 Interrupt Enable */
#define ACIFC_IER_ACINT6            (0x1u << ACIFC_IER_ACINT6_Pos)
#define ACIFC_IER_SUTINT6_Pos       13           /**< \brief (ACIFC_IER) AC6 Startup Time Interrupt Enable */
#define ACIFC_IER_SUTINT6           (0x1u << ACIFC_IER_SUTINT6_Pos)
#define ACIFC_IER_ACINT7_Pos        14           /**< \brief (ACIFC_IER) AC7 Interrupt Enable */
#define ACIFC_IER_ACINT7            (0x1u << ACIFC_IER_ACINT7_Pos)
#define ACIFC_IER_SUTINT7_Pos       15           /**< \brief (ACIFC_IER) AC7 Startup Time Interrupt Enable */
#define ACIFC_IER_SUTINT7           (0x1u << ACIFC_IER_SUTINT7_Pos)
#define ACIFC_IER_WFINT0_Pos        24           /**< \brief (ACIFC_IER) Window0 Mode Interrupt Enable */
#define ACIFC_IER_WFINT0            (0x1u << ACIFC_IER_WFINT0_Pos)
#define ACIFC_IER_WFINT1_Pos        25           /**< \brief (ACIFC_IER) Window1 Mode Interrupt Enable */
#define ACIFC_IER_WFINT1            (0x1u << ACIFC_IER_WFINT1_Pos)
#define ACIFC_IER_WFINT2_Pos        26           /**< \brief (ACIFC_IER) Window2 Mode Interrupt Enable */
#define ACIFC_IER_WFINT2            (0x1u << ACIFC_IER_WFINT2_Pos)
#define ACIFC_IER_WFINT3_Pos        27           /**< \brief (ACIFC_IER) Window3 Mode Interrupt Enable */
#define ACIFC_IER_WFINT3            (0x1u << ACIFC_IER_WFINT3_Pos)
#define ACIFC_IER_MASK              0x0F00FFFFu  /**< \brief (ACIFC_IER) MASK Register */

/* -------- ACIFC_IDR : (ACIFC Offset: 0x14) ( /W 32) Interrupt Disable Register -------- */
#define ACIFC_IDR_OFFSET            0x14         /**< \brief (ACIFC_IDR offset) Interrupt Disable Register */
#define ACIFC_IDR_RESETVALUE        0x00000000   /**< \brief (ACIFC_IDR reset_value) Interrupt Disable Register */

#define ACIFC_IDR_ACINT0_Pos        0            /**< \brief (ACIFC_IDR) AC0 Interrupt Disable */
#define ACIFC_IDR_ACINT0            (0x1u << ACIFC_IDR_ACINT0_Pos)
#define ACIFC_IDR_SUTINT0_Pos       1            /**< \brief (ACIFC_IDR) AC0 Startup Time Interrupt Disable */
#define ACIFC_IDR_SUTINT0           (0x1u << ACIFC_IDR_SUTINT0_Pos)
#define ACIFC_IDR_ACINT1_Pos        2            /**< \brief (ACIFC_IDR) AC1 Interrupt Disable */
#define ACIFC_IDR_ACINT1            (0x1u << ACIFC_IDR_ACINT1_Pos)
#define ACIFC_IDR_SUTINT1_Pos       3            /**< \brief (ACIFC_IDR) AC1 Startup Time Interrupt Disable */
#define ACIFC_IDR_SUTINT1           (0x1u << ACIFC_IDR_SUTINT1_Pos)
#define ACIFC_IDR_ACINT2_Pos        4            /**< \brief (ACIFC_IDR) AC2 Interrupt Disable */
#define ACIFC_IDR_ACINT2            (0x1u << ACIFC_IDR_ACINT2_Pos)
#define ACIFC_IDR_SUTINT2_Pos       5            /**< \brief (ACIFC_IDR) AC2 Startup Time Interrupt Disable */
#define ACIFC_IDR_SUTINT2           (0x1u << ACIFC_IDR_SUTINT2_Pos)
#define ACIFC_IDR_ACINT3_Pos        6            /**< \brief (ACIFC_IDR) AC3 Interrupt Disable */
#define ACIFC_IDR_ACINT3            (0x1u << ACIFC_IDR_ACINT3_Pos)
#define ACIFC_IDR_SUTINT3_Pos       7            /**< \brief (ACIFC_IDR) AC3 Startup Time Interrupt Disable */
#define ACIFC_IDR_SUTINT3           (0x1u << ACIFC_IDR_SUTINT3_Pos)
#define ACIFC_IDR_ACINT4_Pos        8            /**< \brief (ACIFC_IDR) AC4 Interrupt Disable */
#define ACIFC_IDR_ACINT4            (0x1u << ACIFC_IDR_ACINT4_Pos)
#define ACIFC_IDR_SUTINT4_Pos       9            /**< \brief (ACIFC_IDR) AC4 Startup Time Interrupt Disable */
#define ACIFC_IDR_SUTINT4           (0x1u << ACIFC_IDR_SUTINT4_Pos)
#define ACIFC_IDR_ACINT5_Pos        10           /**< \brief (ACIFC_IDR) AC5 Interrupt Disable */
#define ACIFC_IDR_ACINT5            (0x1u << ACIFC_IDR_ACINT5_Pos)
#define ACIFC_IDR_SUTINT5_Pos       11           /**< \brief (ACIFC_IDR) AC5 Startup Time Interrupt Disable */
#define ACIFC_IDR_SUTINT5           (0x1u << ACIFC_IDR_SUTINT5_Pos)
#define ACIFC_IDR_ACINT6_Pos        12           /**< \brief (ACIFC_IDR) AC6 Interrupt Disable */
#define ACIFC_IDR_ACINT6            (0x1u << ACIFC_IDR_ACINT6_Pos)
#define ACIFC_IDR_SUTINT6_Pos       13           /**< \brief (ACIFC_IDR) AC6 Startup Time Interrupt Disable */
#define ACIFC_IDR_SUTINT6           (0x1u << ACIFC_IDR_SUTINT6_Pos)
#define ACIFC_IDR_ACINT7_Pos        14           /**< \brief (ACIFC_IDR) AC7 Interrupt Disable */
#define ACIFC_IDR_ACINT7            (0x1u << ACIFC_IDR_ACINT7_Pos)
#define ACIFC_IDR_SUTINT7_Pos       15           /**< \brief (ACIFC_IDR) AC7 Startup Time Interrupt Disable */
#define ACIFC_IDR_SUTINT7           (0x1u << ACIFC_IDR_SUTINT7_Pos)
#define ACIFC_IDR_WFINT0_Pos        24           /**< \brief (ACIFC_IDR) Window0 Mode Interrupt Disable */
#define ACIFC_IDR_WFINT0            (0x1u << ACIFC_IDR_WFINT0_Pos)
#define ACIFC_IDR_WFINT1_Pos        25           /**< \brief (ACIFC_IDR) Window1 Mode Interrupt Disable */
#define ACIFC_IDR_WFINT1            (0x1u << ACIFC_IDR_WFINT1_Pos)
#define ACIFC_IDR_WFINT2_Pos        26           /**< \brief (ACIFC_IDR) Window2 Mode Interrupt Disable */
#define ACIFC_IDR_WFINT2            (0x1u << ACIFC_IDR_WFINT2_Pos)
#define ACIFC_IDR_WFINT3_Pos        27           /**< \brief (ACIFC_IDR) Window3 Mode Interrupt Disable */
#define ACIFC_IDR_WFINT3            (0x1u << ACIFC_IDR_WFINT3_Pos)
#define ACIFC_IDR_MASK              0x0F00FFFFu  /**< \brief (ACIFC_IDR) MASK Register */

/* -------- ACIFC_IMR : (ACIFC Offset: 0x18) (R/  32) Interrupt Mask Register -------- */
#define ACIFC_IMR_OFFSET            0x18         /**< \brief (ACIFC_IMR offset) Interrupt Mask Register */
#define ACIFC_IMR_RESETVALUE        0x00000000   /**< \brief (ACIFC_IMR reset_value) Interrupt Mask Register */

