Klipper3d/klipper/lib/asf/sam/utils/cmsis/sam4l/include/component/component_acifc.h
#define ACIFC_IMR_ACINT0_Pos        0            /**< \brief (ACIFC_IMR) AC0 Interrupt Mask */
#define ACIFC_IMR_ACINT0            (0x1u << ACIFC_IMR_ACINT0_Pos)
#define ACIFC_IMR_SUTINT0_Pos       1            /**< \brief (ACIFC_IMR) AC0 Startup Time Interrupt Mask */
#define ACIFC_IMR_SUTINT0           (0x1u << ACIFC_IMR_SUTINT0_Pos)
#define ACIFC_IMR_ACINT1_Pos        2            /**< \brief (ACIFC_IMR) AC1 Interrupt Mask */
#define ACIFC_IMR_ACINT1            (0x1u << ACIFC_IMR_ACINT1_Pos)
#define ACIFC_IMR_SUTINT1_Pos       3            /**< \brief (ACIFC_IMR) AC1 Startup Time Interrupt Mask */
#define ACIFC_IMR_SUTINT1           (0x1u << ACIFC_IMR_SUTINT1_Pos)
#define ACIFC_IMR_ACINT2_Pos        4            /**< \brief (ACIFC_IMR) AC2 Interrupt Mask */
#define ACIFC_IMR_ACINT2            (0x1u << ACIFC_IMR_ACINT2_Pos)
#define ACIFC_IMR_SUTINT2_Pos       5            /**< \brief (ACIFC_IMR) AC2 Startup Time Interrupt Mask */
#define ACIFC_IMR_SUTINT2           (0x1u << ACIFC_IMR_SUTINT2_Pos)
#define ACIFC_IMR_ACINT3_Pos        6            /**< \brief (ACIFC_IMR) AC3 Interrupt Mask */
#define ACIFC_IMR_ACINT3            (0x1u << ACIFC_IMR_ACINT3_Pos)
#define ACIFC_IMR_SUTINT3_Pos       7            /**< \brief (ACIFC_IMR) AC3 Startup Time Interrupt Mask */
#define ACIFC_IMR_SUTINT3           (0x1u << ACIFC_IMR_SUTINT3_Pos)
#define ACIFC_IMR_ACINT4_Pos        8            /**< \brief (ACIFC_IMR) AC4 Interrupt Mask */
#define ACIFC_IMR_ACINT4            (0x1u << ACIFC_IMR_ACINT4_Pos)
#define ACIFC_IMR_SUTINT4_Pos       9            /**< \brief (ACIFC_IMR) AC4 Startup Time Interrupt Mask */
#define ACIFC_IMR_SUTINT4           (0x1u << ACIFC_IMR_SUTINT4_Pos)
#define ACIFC_IMR_ACINT5_Pos        10           /**< \brief (ACIFC_IMR) AC5 Interrupt Mask */
#define ACIFC_IMR_ACINT5            (0x1u << ACIFC_IMR_ACINT5_Pos)
#define ACIFC_IMR_SUTINT5_Pos       11           /**< \brief (ACIFC_IMR) AC5 Startup Time Interrupt Mask */
#define ACIFC_IMR_SUTINT5           (0x1u << ACIFC_IMR_SUTINT5_Pos)
#define ACIFC_IMR_ACINT6_Pos        12           /**< \brief (ACIFC_IMR) AC6 Interrupt Mask */
#define ACIFC_IMR_ACINT6            (0x1u << ACIFC_IMR_ACINT6_Pos)
#define ACIFC_IMR_SUTINT6_Pos       13           /**< \brief (ACIFC_IMR) AC6 Startup Time Interrupt Mask */
#define ACIFC_IMR_SUTINT6           (0x1u << ACIFC_IMR_SUTINT6_Pos)
#define ACIFC_IMR_ACINT7_Pos        14           /**< \brief (ACIFC_IMR) AC7 Interrupt Mask */
#define ACIFC_IMR_ACINT7            (0x1u << ACIFC_IMR_ACINT7_Pos)
#define ACIFC_IMR_SUTINT7_Pos       15           /**< \brief (ACIFC_IMR) AC7 Startup Time Interrupt Mask */
#define ACIFC_IMR_SUTINT7           (0x1u << ACIFC_IMR_SUTINT7_Pos)
#define ACIFC_IMR_WFINT0_Pos        24           /**< \brief (ACIFC_IMR) Window0 Mode Interrupt Mask */
#define ACIFC_IMR_WFINT0            (0x1u << ACIFC_IMR_WFINT0_Pos)
#define ACIFC_IMR_WFINT1_Pos        25           /**< \brief (ACIFC_IMR) Window1 Mode Interrupt Mask */
#define ACIFC_IMR_WFINT1            (0x1u << ACIFC_IMR_WFINT1_Pos)
#define ACIFC_IMR_WFINT2_Pos        26           /**< \brief (ACIFC_IMR) Window2 Mode Interrupt Mask */
#define ACIFC_IMR_WFINT2            (0x1u << ACIFC_IMR_WFINT2_Pos)
#define ACIFC_IMR_WFINT3_Pos        27           /**< \brief (ACIFC_IMR) Window3 Mode Interrupt Mask */
#define ACIFC_IMR_WFINT3            (0x1u << ACIFC_IMR_WFINT3_Pos)
#define ACIFC_IMR_MASK              0x0F00FFFFu  /**< \brief (ACIFC_IMR) MASK Register */

/* -------- ACIFC_ISR : (ACIFC Offset: 0x1C) (R/  32) Interrupt Status Register -------- */
#define ACIFC_ISR_OFFSET            0x1C         /**< \brief (ACIFC_ISR offset) Interrupt Status Register */
#define ACIFC_ISR_RESETVALUE        0x00000000   /**< \brief (ACIFC_ISR reset_value) Interrupt Status Register */

#define ACIFC_ISR_ACINT0_Pos        0            /**< \brief (ACIFC_ISR) AC0 Interrupt Status */
#define ACIFC_ISR_ACINT0            (0x1u << ACIFC_ISR_ACINT0_Pos)
#define ACIFC_ISR_SUTINT0_Pos       1            /**< \brief (ACIFC_ISR) AC0 Startup Time Interrupt Status */
#define ACIFC_ISR_SUTINT0           (0x1u << ACIFC_ISR_SUTINT0_Pos)
#define ACIFC_ISR_ACINT1_Pos        2            /**< \brief (ACIFC_ISR) AC1 Interrupt Status */
#define ACIFC_ISR_ACINT1            (0x1u << ACIFC_ISR_ACINT1_Pos)
#define ACIFC_ISR_SUTINT1_Pos       3            /**< \brief (ACIFC_ISR) AC1 Startup Time Interrupt Status */
#define ACIFC_ISR_SUTINT1           (0x1u << ACIFC_ISR_SUTINT1_Pos)
#define ACIFC_ISR_ACINT2_Pos        4            /**< \brief (ACIFC_ISR) AC2 Interrupt Status */
#define ACIFC_ISR_ACINT2            (0x1u << ACIFC_ISR_ACINT2_Pos)
#define ACIFC_ISR_SUTINT2_Pos       5            /**< \brief (ACIFC_ISR) AC2 Startup Time Interrupt Status */
#define ACIFC_ISR_SUTINT2           (0x1u << ACIFC_ISR_SUTINT2_Pos)
#define ACIFC_ISR_ACINT3_Pos        6            /**< \brief (ACIFC_ISR) AC3 Interrupt Status */
#define ACIFC_ISR_ACINT3            (0x1u << ACIFC_ISR_ACINT3_Pos)
#define ACIFC_ISR_SUTINT3_Pos       7            /**< \brief (ACIFC_ISR) AC3 Startup Time Interrupt Status */
#define ACIFC_ISR_SUTINT3           (0x1u << ACIFC_ISR_SUTINT3_Pos)
#define ACIFC_ISR_ACINT4_Pos        8            /**< \brief (ACIFC_ISR) AC4 Interrupt Status */
#define ACIFC_ISR_ACINT4            (0x1u << ACIFC_ISR_ACINT4_Pos)
#define ACIFC_ISR_SUTINT4_Pos       9            /**< \brief (ACIFC_ISR) AC4 Startup Time Interrupt Status */
#define ACIFC_ISR_SUTINT4           (0x1u << ACIFC_ISR_SUTINT4_Pos)
#define ACIFC_ISR_ACINT5_Pos        10           /**< \brief (ACIFC_ISR) AC5 Interrupt Status */
#define ACIFC_ISR_ACINT5            (0x1u << ACIFC_ISR_ACINT5_Pos)
#define ACIFC_ISR_SUTINT5_Pos       11           /**< \brief (ACIFC_ISR) AC5 Startup Time Interrupt Status */
#define ACIFC_ISR_SUTINT5           (0x1u << ACIFC_ISR_SUTINT5_Pos)
#define ACIFC_ISR_ACINT6_Pos        12           /**< \brief (ACIFC_ISR) AC6 Interrupt Status */
#define ACIFC_ISR_ACINT6            (0x1u << ACIFC_ISR_ACINT6_Pos)
#define ACIFC_ISR_SUTINT6_Pos       13           /**< \brief (ACIFC_ISR) AC6 Startup Time Interrupt Status */
#define ACIFC_ISR_SUTINT6           (0x1u << ACIFC_ISR_SUTINT6_Pos)
#define ACIFC_ISR_ACINT7_Pos        14           /**< \brief (ACIFC_ISR) AC7 Interrupt Status */
#define ACIFC_ISR_ACINT7            (0x1u << ACIFC_ISR_ACINT7_Pos)
#define ACIFC_ISR_SUTINT7_Pos       15           /**< \brief (ACIFC_ISR) AC7 Startup Time Interrupt Status */
#define ACIFC_ISR_SUTINT7           (0x1u << ACIFC_ISR_SUTINT7_Pos)
#define ACIFC_ISR_WFINT0_Pos        24           /**< \brief (ACIFC_ISR) Window0 Mode Interrupt Status */
#define ACIFC_ISR_WFINT0            (0x1u << ACIFC_ISR_WFINT0_Pos)
#define ACIFC_ISR_WFINT1_Pos        25           /**< \brief (ACIFC_ISR) Window1 Mode Interrupt Status */
#define ACIFC_ISR_WFINT1            (0x1u << ACIFC_ISR_WFINT1_Pos)
#define ACIFC_ISR_WFINT2_Pos        26           /**< \brief (ACIFC_ISR) Window2 Mode Interrupt Status */
#define ACIFC_ISR_WFINT2            (0x1u << ACIFC_ISR_WFINT2_Pos)
#define ACIFC_ISR_WFINT3_Pos        27           /**< \brief (ACIFC_ISR) Window3 Mode Interrupt Status */
#define ACIFC_ISR_WFINT3            (0x1u << ACIFC_ISR_WFINT3_Pos)
#define ACIFC_ISR_MASK              0x0F00FFFFu  /**< \brief (ACIFC_ISR) MASK Register */

