Klipper3d/klipper/lib/asf/sam/utils/cmsis/sam4l/include/component/component_acifc.h
/* -------- ACIFC_ICR : (ACIFC Offset: 0x20) ( /W 32) Interrupt Status Clear Register -------- */
#define ACIFC_ICR_OFFSET            0x20         /**< \brief (ACIFC_ICR offset) Interrupt Status Clear Register */
#define ACIFC_ICR_RESETVALUE        0x00000000   /**< \brief (ACIFC_ICR reset_value) Interrupt Status Clear Register */

#define ACIFC_ICR_ACINT0_Pos        0            /**< \brief (ACIFC_ICR) AC0 Interrupt Status Clear */
#define ACIFC_ICR_ACINT0            (0x1u << ACIFC_ICR_ACINT0_Pos)
#define ACIFC_ICR_SUTINT0_Pos       1            /**< \brief (ACIFC_ICR) AC0 Startup Time Interrupt Status Clear */
#define ACIFC_ICR_SUTINT0           (0x1u << ACIFC_ICR_SUTINT0_Pos)
#define ACIFC_ICR_ACINT1_Pos        2            /**< \brief (ACIFC_ICR) AC1 Interrupt Status Clear */
#define ACIFC_ICR_ACINT1            (0x1u << ACIFC_ICR_ACINT1_Pos)
#define ACIFC_ICR_SUTINT1_Pos       3            /**< \brief (ACIFC_ICR) AC1 Startup Time Interrupt Status Clear */
#define ACIFC_ICR_SUTINT1           (0x1u << ACIFC_ICR_SUTINT1_Pos)
#define ACIFC_ICR_ACINT2_Pos        4            /**< \brief (ACIFC_ICR) AC2 Interrupt Status Clear */
#define ACIFC_ICR_ACINT2            (0x1u << ACIFC_ICR_ACINT2_Pos)
#define ACIFC_ICR_SUTINT2_Pos       5            /**< \brief (ACIFC_ICR) AC2 Startup Time Interrupt Status Clear */
#define ACIFC_ICR_SUTINT2           (0x1u << ACIFC_ICR_SUTINT2_Pos)
#define ACIFC_ICR_ACINT3_Pos        6            /**< \brief (ACIFC_ICR) AC3 Interrupt Status Clear */
#define ACIFC_ICR_ACINT3            (0x1u << ACIFC_ICR_ACINT3_Pos)
#define ACIFC_ICR_SUTINT3_Pos       7            /**< \brief (ACIFC_ICR) AC3 Startup Time Interrupt Status Clear */
#define ACIFC_ICR_SUTINT3           (0x1u << ACIFC_ICR_SUTINT3_Pos)
#define ACIFC_ICR_ACINT4_Pos        8            /**< \brief (ACIFC_ICR) AC4 Interrupt Status Clear */
#define ACIFC_ICR_ACINT4            (0x1u << ACIFC_ICR_ACINT4_Pos)
#define ACIFC_ICR_SUTINT4_Pos       9            /**< \brief (ACIFC_ICR) AC4 Startup Time Interrupt Status Clear */
#define ACIFC_ICR_SUTINT4           (0x1u << ACIFC_ICR_SUTINT4_Pos)
#define ACIFC_ICR_ACINT5_Pos        10           /**< \brief (ACIFC_ICR) AC5 Interrupt Status Clear */
#define ACIFC_ICR_ACINT5            (0x1u << ACIFC_ICR_ACINT5_Pos)
#define ACIFC_ICR_SUTINT5_Pos       11           /**< \brief (ACIFC_ICR) AC5 Startup Time Interrupt Status Clear */
#define ACIFC_ICR_SUTINT5           (0x1u << ACIFC_ICR_SUTINT5_Pos)
#define ACIFC_ICR_ACINT6_Pos        12           /**< \brief (ACIFC_ICR) AC6 Interrupt Status Clear */
#define ACIFC_ICR_ACINT6            (0x1u << ACIFC_ICR_ACINT6_Pos)
#define ACIFC_ICR_SUTINT6_Pos       13           /**< \brief (ACIFC_ICR) AC6 Startup Time Interrupt Status Clear */
#define ACIFC_ICR_SUTINT6           (0x1u << ACIFC_ICR_SUTINT6_Pos)
#define ACIFC_ICR_ACINT7_Pos        14           /**< \brief (ACIFC_ICR) AC7 Interrupt Status Clear */
#define ACIFC_ICR_ACINT7            (0x1u << ACIFC_ICR_ACINT7_Pos)
#define ACIFC_ICR_SUTINT7_Pos       15           /**< \brief (ACIFC_ICR) AC7 Startup Time Interrupt Status Clear */
#define ACIFC_ICR_SUTINT7           (0x1u << ACIFC_ICR_SUTINT7_Pos)
#define ACIFC_ICR_WFINT0_Pos        24           /**< \brief (ACIFC_ICR) Window0 Mode Interrupt Status Clear */
#define ACIFC_ICR_WFINT0            (0x1u << ACIFC_ICR_WFINT0_Pos)
#define ACIFC_ICR_WFINT1_Pos        25           /**< \brief (ACIFC_ICR) Window1 Mode Interrupt Status Clear */
#define ACIFC_ICR_WFINT1            (0x1u << ACIFC_ICR_WFINT1_Pos)
#define ACIFC_ICR_WFINT2_Pos        26           /**< \brief (ACIFC_ICR) Window2 Mode Interrupt Status Clear */
#define ACIFC_ICR_WFINT2            (0x1u << ACIFC_ICR_WFINT2_Pos)
#define ACIFC_ICR_WFINT3_Pos        27           /**< \brief (ACIFC_ICR) Window3 Mode Interrupt Status Clear */
#define ACIFC_ICR_WFINT3            (0x1u << ACIFC_ICR_WFINT3_Pos)
#define ACIFC_ICR_MASK              0x0F00FFFFu  /**< \brief (ACIFC_ICR) MASK Register */

/* -------- ACIFC_TR : (ACIFC Offset: 0x24) (R/W 32) Test Register -------- */
#define ACIFC_TR_OFFSET             0x24         /**< \brief (ACIFC_TR offset) Test Register */
#define ACIFC_TR_RESETVALUE         0x00000000   /**< \brief (ACIFC_TR reset_value) Test Register */

#define ACIFC_TR_ACTEST0_Pos        0            /**< \brief (ACIFC_TR) AC0 Output Override Value */
#define ACIFC_TR_ACTEST0            (0x1u << ACIFC_TR_ACTEST0_Pos)
#define ACIFC_TR_ACTEST1_Pos        1            /**< \brief (ACIFC_TR) AC1 Output Override Value */
#define ACIFC_TR_ACTEST1            (0x1u << ACIFC_TR_ACTEST1_Pos)
#define ACIFC_TR_ACTEST2_Pos        2            /**< \brief (ACIFC_TR) AC2 Output Override Value */
#define ACIFC_TR_ACTEST2            (0x1u << ACIFC_TR_ACTEST2_Pos)
#define ACIFC_TR_ACTEST3_Pos        3            /**< \brief (ACIFC_TR) AC3 Output Override Value */
#define ACIFC_TR_ACTEST3            (0x1u << ACIFC_TR_ACTEST3_Pos)
#define ACIFC_TR_ACTEST4_Pos        4            /**< \brief (ACIFC_TR) AC4 Output Override Value */
#define ACIFC_TR_ACTEST4            (0x1u << ACIFC_TR_ACTEST4_Pos)
#define ACIFC_TR_ACTEST5_Pos        5            /**< \brief (ACIFC_TR) AC5 Output Override Value */
#define ACIFC_TR_ACTEST5            (0x1u << ACIFC_TR_ACTEST5_Pos)
#define ACIFC_TR_ACTEST6_Pos        6            /**< \brief (ACIFC_TR) AC6 Output Override Value */
#define ACIFC_TR_ACTEST6            (0x1u << ACIFC_TR_ACTEST6_Pos)
#define ACIFC_TR_ACTEST7_Pos        7            /**< \brief (ACIFC_TR) AC7 Output Override Value */
#define ACIFC_TR_ACTEST7            (0x1u << ACIFC_TR_ACTEST7_Pos)
#define ACIFC_TR_MASK               0x000000FFu  /**< \brief (ACIFC_TR) MASK Register */

/* -------- ACIFC_PARAMETER : (ACIFC Offset: 0x30) (R/  32) Parameter Register -------- */
#define ACIFC_PARAMETER_OFFSET      0x30         /**< \brief (ACIFC_PARAMETER offset) Parameter Register */

#define ACIFC_PARAMETER_ACIMPL0_Pos 0            /**< \brief (ACIFC_PARAMETER) Analog Comparator 0 Implemented */
#define ACIFC_PARAMETER_ACIMPL0     (0x1u << ACIFC_PARAMETER_ACIMPL0_Pos)
#define ACIFC_PARAMETER_ACIMPL1_Pos 1            /**< \brief (ACIFC_PARAMETER) Analog Comparator 1 Implemented */
#define ACIFC_PARAMETER_ACIMPL1     (0x1u << ACIFC_PARAMETER_ACIMPL1_Pos)
#define ACIFC_PARAMETER_ACIMPL2_Pos 2            /**< \brief (ACIFC_PARAMETER) Analog Comparator 2 Implemented */
#define ACIFC_PARAMETER_ACIMPL2     (0x1u << ACIFC_PARAMETER_ACIMPL2_Pos)
#define ACIFC_PARAMETER_ACIMPL3_Pos 3            /**< \brief (ACIFC_PARAMETER) Analog Comparator 3 Implemented */
#define ACIFC_PARAMETER_ACIMPL3     (0x1u << ACIFC_PARAMETER_ACIMPL3_Pos)
#define ACIFC_PARAMETER_ACIMPL4_Pos 4            /**< \brief (ACIFC_PARAMETER) Analog Comparator 4 Implemented */
#define ACIFC_PARAMETER_ACIMPL4     (0x1u << ACIFC_PARAMETER_ACIMPL4_Pos)
#define ACIFC_PARAMETER_ACIMPL5_Pos 5            /**< \brief (ACIFC_PARAMETER) Analog Comparator 5 Implemented */
#define ACIFC_PARAMETER_ACIMPL5     (0x1u << ACIFC_PARAMETER_ACIMPL5_Pos)
#define ACIFC_PARAMETER_ACIMPL6_Pos 6            /**< \brief (ACIFC_PARAMETER) Analog Comparator 6 Implemented */
#define ACIFC_PARAMETER_ACIMPL6     (0x1u << ACIFC_PARAMETER_ACIMPL6_Pos)
#define ACIFC_PARAMETER_ACIMPL7_Pos 7            /**< \brief (ACIFC_PARAMETER) Analog Comparator 7 Implemented */
#define ACIFC_PARAMETER_ACIMPL7     (0x1u << ACIFC_PARAMETER_ACIMPL7_Pos)
#define ACIFC_PARAMETER_WIMPL0_Pos  16           /**< \brief (ACIFC_PARAMETER) Window0 Mode  Implemented */
#define ACIFC_PARAMETER_WIMPL0      (0x1u << ACIFC_PARAMETER_WIMPL0_Pos)
#define ACIFC_PARAMETER_WIMPL1_Pos  17           /**< \brief (ACIFC_PARAMETER) Window1 Mode  Implemented */
#define ACIFC_PARAMETER_WIMPL1      (0x1u << ACIFC_PARAMETER_WIMPL1_Pos)
#define ACIFC_PARAMETER_WIMPL2_Pos  18           /**< \brief (ACIFC_PARAMETER) Window2 Mode  Implemented */
#define ACIFC_PARAMETER_WIMPL2      (0x1u << ACIFC_PARAMETER_WIMPL2_Pos)
#define ACIFC_PARAMETER_WIMPL3_Pos  19           /**< \brief (ACIFC_PARAMETER) Window3 Mode  Implemented */
#define ACIFC_PARAMETER_WIMPL3      (0x1u << ACIFC_PARAMETER_WIMPL3_Pos)
#define ACIFC_PARAMETER_MASK        0x000F00FFu  /**< \brief (ACIFC_PARAMETER) MASK Register */

/* -------- ACIFC_VERSION : (ACIFC Offset: 0x34) (R/  32) Version Register -------- */
#define ACIFC_VERSION_OFFSET        0x34         /**< \brief (ACIFC_VERSION offset) Version Register */
#define ACIFC_VERSION_RESETVALUE    0x00000101   /**< \brief (ACIFC_VERSION reset_value) Version Register */

#define ACIFC_VERSION_VERSION_Pos   0            /**< \brief (ACIFC_VERSION) Version Number */
#define ACIFC_VERSION_VERSION_Msk   (0xFFFu << ACIFC_VERSION_VERSION_Pos)
#define ACIFC_VERSION_VERSION(value) ((ACIFC_VERSION_VERSION_Msk & ((value) << ACIFC_VERSION_VERSION_Pos)))
#define ACIFC_VERSION_VARIANT_Pos   16           /**< \brief (ACIFC_VERSION) Variant Number */
#define ACIFC_VERSION_VARIANT_Msk   (0xFu << ACIFC_VERSION_VARIANT_Pos)
#define ACIFC_VERSION_VARIANT(value) ((ACIFC_VERSION_VARIANT_Msk & ((value) << ACIFC_VERSION_VARIANT_Pos)))
#define ACIFC_VERSION_MASK          0x000F0FFFu  /**< \brief (ACIFC_VERSION) MASK Register */

/* -------- ACIFC_CONFW : (ACIFC Offset: 0x80) (R/W 32) CONFW Window configuration Register -------- */
#define ACIFC_CONFW_OFFSET          0x80         /**< \brief (ACIFC_CONFW offset) Window configuration Register */
#define ACIFC_CONFW_RESETVALUE      0x00000000   /**< \brief (ACIFC_CONFW reset_value) Window configuration Register */

#define ACIFC_CONFW_WIS_Pos         0            /**< \brief (ACIFC_CONFW) Window Mode Interrupt Settings */
#define ACIFC_CONFW_WIS_Msk         (0x7u << ACIFC_CONFW_WIS_Pos)
#define ACIFC_CONFW_WIS(value)      ((ACIFC_CONFW_WIS_Msk & ((value) << ACIFC_CONFW_WIS_Pos)))
#define ACIFC_CONFW_WEVSRC_Pos      8            /**< \brief (ACIFC_CONFW) Peripheral Event Sourse Selection for Window Mode */
#define ACIFC_CONFW_WEVSRC_Msk      (0x7u << ACIFC_CONFW_WEVSRC_Pos)
#define ACIFC_CONFW_WEVSRC(value)   ((ACIFC_CONFW_WEVSRC_Msk & ((value) << ACIFC_CONFW_WEVSRC_Pos)))
#define ACIFC_CONFW_WEVEN_Pos       11           /**< \brief (ACIFC_CONFW) Window Peripheral Event Enable */
#define ACIFC_CONFW_WEVEN           (0x1u << ACIFC_CONFW_WEVEN_Pos)
#define ACIFC_CONFW_WFEN_Pos        16           /**< \brief (ACIFC_CONFW) Window Mode Enable */
#define ACIFC_CONFW_WFEN            (0x1u << ACIFC_CONFW_WFEN_Pos)
#define ACIFC_CONFW_MASK            0x00010F07u  /**< \brief (ACIFC_CONFW) MASK Register */

