Klipper3d/klipper/lib/asf/sam/utils/cmsis/sam4l/include/component/component_acifc.h
/* -------- ACIFC_CONF : (ACIFC Offset: 0xD0) (R/W 32) CONF AC Configuration Register -------- */
#define ACIFC_CONF_OFFSET           0xD0         /**< \brief (ACIFC_CONF offset) AC Configuration Register */
#define ACIFC_CONF_RESETVALUE       0x00000000   /**< \brief (ACIFC_CONF reset_value) AC Configuration Register */

#define ACIFC_CONF_IS_Pos           0            /**< \brief (ACIFC_CONF) Interupt Settings */
#define ACIFC_CONF_IS_Msk           (0x3u << ACIFC_CONF_IS_Pos)
#define ACIFC_CONF_IS(value)        ((ACIFC_CONF_IS_Msk & ((value) << ACIFC_CONF_IS_Pos)))
#define ACIFC_CONF_MODE_Pos         4            /**< \brief (ACIFC_CONF) Analog Comparator Mode */
#define ACIFC_CONF_MODE_Msk         (0x3u << ACIFC_CONF_MODE_Pos)
#define ACIFC_CONF_MODE(value)      ((ACIFC_CONF_MODE_Msk & ((value) << ACIFC_CONF_MODE_Pos)))
#define ACIFC_CONF_INSELN_Pos       8            /**< \brief (ACIFC_CONF) Negative Input Select */
#define ACIFC_CONF_INSELN_Msk       (0x3u << ACIFC_CONF_INSELN_Pos)
#define ACIFC_CONF_INSELN(value)    ((ACIFC_CONF_INSELN_Msk & ((value) << ACIFC_CONF_INSELN_Pos)))
#define ACIFC_CONF_EVENN_Pos        16           /**< \brief (ACIFC_CONF) Peripheral Event Enable Negative */
#define ACIFC_CONF_EVENN            (0x1u << ACIFC_CONF_EVENN_Pos)
#define ACIFC_CONF_EVENP_Pos        17           /**< \brief (ACIFC_CONF) Peripheral Event Enable Positive */
#define ACIFC_CONF_EVENP            (0x1u << ACIFC_CONF_EVENP_Pos)
#define ACIFC_CONF_HYS_Pos          24           /**< \brief (ACIFC_CONF) Hysteresis Voltage Value */
#define ACIFC_CONF_HYS_Msk          (0x3u << ACIFC_CONF_HYS_Pos)
#define ACIFC_CONF_HYS(value)       ((ACIFC_CONF_HYS_Msk & ((value) << ACIFC_CONF_HYS_Pos)))
#define ACIFC_CONF_FAST_Pos         26           /**< \brief (ACIFC_CONF) Fast Mode Enable */
#define ACIFC_CONF_FAST             (0x1u << ACIFC_CONF_FAST_Pos)
#define ACIFC_CONF_ALWAYSON_Pos     27           /**< \brief (ACIFC_CONF) Always On */
#define ACIFC_CONF_ALWAYSON         (0x1u << ACIFC_CONF_ALWAYSON_Pos)
#define ACIFC_CONF_MASK             0x0F030333u  /**< \brief (ACIFC_CONF) MASK Register */

/** \brief AcifcConf hardware registers */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef struct {
  RwReg   ACIFC_CONF;         /**< \brief (ACIFC Offset: 0x00) AC Configuration Register */
} AcifcConf;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/** \brief AcifcConfw hardware registers */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef struct {
  RwReg   ACIFC_CONFW;        /**< \brief (ACIFC Offset: 0x00) Window configuration Register */
} AcifcConfw;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/** \brief ACIFC hardware registers */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef struct {
  RwReg   ACIFC_CTRL;         /**< \brief (ACIFC Offset: 0x00) Control Register */
  RoReg   ACIFC_SR;           /**< \brief (ACIFC Offset: 0x04) Status Register */
  RoReg8  Reserved1[0x8];
  WoReg   ACIFC_IER;          /**< \brief (ACIFC Offset: 0x10) Interrupt Enable Register */
  WoReg   ACIFC_IDR;          /**< \brief (ACIFC Offset: 0x14) Interrupt Disable Register */
  RoReg   ACIFC_IMR;          /**< \brief (ACIFC Offset: 0x18) Interrupt Mask Register */
  RoReg   ACIFC_ISR;          /**< \brief (ACIFC Offset: 0x1C) Interrupt Status Register */
  WoReg   ACIFC_ICR;          /**< \brief (ACIFC Offset: 0x20) Interrupt Status Clear Register */
  RwReg   ACIFC_TR;           /**< \brief (ACIFC Offset: 0x24) Test Register */
  RoReg8  Reserved2[0x8];
  RoReg   ACIFC_PARAMETER;    /**< \brief (ACIFC Offset: 0x30) Parameter Register */
  RoReg   ACIFC_VERSION;      /**< \brief (ACIFC Offset: 0x34) Version Register */
  RoReg8  Reserved3[0x48];
  AcifcConfw ACIFC_CONFW[4];     /**< \brief (ACIFC Offset: 0x80) AcifcConfw groups */
  RoReg8  Reserved4[0x40];
  AcifcConf ACIFC_CONF[8];      /**< \brief (ACIFC Offset: 0xD0) AcifcConf groups */
} Acifc;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/*@}*/

#endif /* _SAM4L_ACIFC_COMPONENT_ */
